load-tests/artillery-buildings.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3000' }}"
  phases:
    - duration: 120
      arrivalRate: 2
    - duration: 300
      arrivalRate: 10
  defaults:
    headers:
      x-load-test: "artillery-buildings"
      content-type: "multipart/form-data"

scenarios:
  - name: "create-building-no-image"
    weight: 60
    flow:
      - post:
          url: "/api/buildings"
          formData:
            lat: "51.9242"
            lng: "4.4792"
            category: "övrig"
            state: "hotad"
            buildingName: "Load Test Building"
            contributor-email: "loadtest@example.com"
            privacyConsent: "on"
  - name: "create-building-single-image"
    weight: 30
    flow:
      - post:
          url: "/api/buildings"
          formData:
            lat: "51.9242"
            lng: "4.4792"
            category: "övrig"
            state: "hotad"
            buildingName: "Load Test Building"
            contributor-email: "loadtest@example.com"
            privacyConsent: "on"
            images:
              fromFile: "./fixtures/building-1.jpg"
  - name: "create-building-three-images"
    weight: 10
    flow:
      - post:
          url: "/api/buildings"
          formData:
            lat: "51.9242"
            lng: "4.4792"
            category: "övrig"
            state: "hotad"
            buildingName: "Load Test Building"
            contributor-email: "loadtest@example.com"
            privacyConsent: "on"
            images:
              fromFile:
                - "./fixtures/building-1.jpg"
                - "./fixtures/building-2.jpg"
                - "./fixtures/building-3.jpg"